summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEth_reg.h
/**
 * \file IfxEth_reg.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1585 $
 * $Date: 2013-09-03 13:30:24 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Eth_Cfg Eth address
 * \ingroup IfxLld_Eth
 * 
 * \defgroup IfxLld_Eth_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Eth_Cfg
 * 
 * \defgroup IfxLld_Eth_Cfg_Eth 2-ETH
 * \ingroup IfxLld_Eth_Cfg
 * 
 */
#ifndef IFXETH_REG_H
#define IFXETH_REG_H
/******************************************************************************/
#include "IfxEth_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Eth_Cfg_BaseAddress
 * \{  */

/** \\brief  ETH object */
#define MODULE_ETH /*lint --e(923)*/ ((*(Ifx_ETH*)0xF001D000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eth_Cfg_Eth
 * \{  */

/** \\brief  C, Access Enable Register 0 */
#define ETH_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_ETH_ACCEN0*)0xF001D00Cu)

/** \\brief  10, Access Enable Register 1 */
#define ETH_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_ETH_ACCEN1*)0xF001D010u)

/** \\brief  202C, Register 11 - AHB or AXI Status Register */
#define ETH_AHB_OR_AXI_STATUS /*lint --e(923)*/ (*(volatile Ifx_ETH_AHB_OR_AXI_STATUS*)0xF001F02Cu)

/** \\brief  2000, Register 0 - Bus Mode Register */
#define ETH_BUS_MODE /*lint --e(923)*/ (*(volatile Ifx_ETH_BUS_MODE*)0xF001F000u)

/** \\brief  0, Clock Control Register */
#define ETH_CLC /*lint --e(923)*/ (*(volatile Ifx_ETH_CLC*)0xF001D000u)

/** \\brief  2054, Register 21 - Current Host Receive Buffer Address Register */
#define ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS /*lint --e(923)*/ (*(volatile Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS*)0xF001F054u)

/** \\brief  204C, Register 19 - Current Host Receive Descriptor Register */
#define ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR /*lint --e(923)*/ (*(volatile Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR*)0xF001F04Cu)

/** \\brief  2050, Register 20 - Current Host Transmit Buffer Address Register */
#define ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS /*lint --e(923)*/ (*(volatile Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS*)0xF001F050u)

/** \\brief  2048, Register 18 - Current Host Transmit Descriptor Register */
#define ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR /*lint --e(923)*/ (*(volatile Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR*)0xF001F048u)

/** \\brief  1024, Register 9 - Debug Register */
#define ETH_DEBUG /*lint --e(923)*/ (*(volatile Ifx_ETH_DEBUG*)0xF001E024u)

/** \\brief  1018, Register 6 - Flow Control Register */
#define ETH_FLOW_CONTROL /*lint --e(923)*/ (*(volatile Ifx_ETH_FLOW_CONTROL*)0xF001E018u)

/** \\brief  1010, Register 4 - GMII Address Register */
#define ETH_GMII_ADDRESS /*lint --e(923)*/ (*(volatile Ifx_ETH_GMII_ADDRESS*)0xF001E010u)

/** \\brief  1014, Register 5 - GMII Data Register */
#define ETH_GMII_DATA /*lint --e(923)*/ (*(volatile Ifx_ETH_GMII_DATA*)0xF001E014u)

/** \\brief  8, Input and Output Control Register */
#define ETH_GPCTL /*lint --e(923)*/ (*(volatile Ifx_ETH_GPCTL*)0xF001D008u)

/** \\brief  1008, Register 2 - Hash Table High Register */
#define ETH_HASH_TABLE_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_HASH_TABLE_HIGH*)0xF001E008u)

/** \\brief  100C, Register 3 - Hash Table Low Register */
#define ETH_HASH_TABLE_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_HASH_TABLE_LOW*)0xF001E00Cu)

/** \\brief  2058, Register 22 - HW Feature Register */
#define ETH_HW_FEATURE /*lint --e(923)*/ (*(volatile Ifx_ETH_HW_FEATURE*)0xF001F058u)

/** \\brief  4, Module Identification Register */
#define ETH_ID /*lint --e(923)*/ (*(volatile Ifx_ETH_ID*)0xF001D004u)

/** \\brief  201C, Register 7 - Interrupt Enable Register */
#define ETH_INTERRUPT_ENABLE /*lint --e(923)*/ (*(volatile Ifx_ETH_INTERRUPT_ENABLE*)0xF001F01Cu)

/** \\brief  103C, Register 15 - Interrupt Mask Register */
#define ETH_INTERRUPT_MASK /*lint --e(923)*/ (*(volatile Ifx_ETH_INTERRUPT_MASK*)0xF001E03Cu)

/** \\brief  1038, Register 14 - Interrupt Register */
#define ETH_INTERRUPT_STATUS /*lint --e(923)*/ (*(volatile Ifx_ETH_INTERRUPT_STATUS*)0xF001E038u)

/** \\brief  14, Kernel Reset Register 0 */
#define ETH_KRST0 /*lint --e(923)*/ (*(volatile Ifx_ETH_KRST0*)0xF001D014u)

/** \\brief  18, Kernel Reset Register 1 */
#define ETH_KRST1 /*lint --e(923)*/ (*(volatile Ifx_ETH_KRST1*)0xF001D018u)

/** \\brief  1C, Kernel Reset Status Clear Register */
#define ETH_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_ETH_KRSTCLR*)0xF001D01Cu)

/** \\brief  1040, MAC Address High Register */
#define ETH_MAC_ADDRESS_G00_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E040u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G00_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G00_HIGH.
*/
#define	ETH_MAC_ADDRESS0_HIGH	(ETH_MAC_ADDRESS_G00_HIGH)

/** \\brief  1044, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G00_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E044u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G00_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G00_LOW.
*/
#define	ETH_MAC_ADDRESS0_LOW	(ETH_MAC_ADDRESS_G00_LOW)

