summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEth_reg.h
/** \\brief  1874, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G114_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E874u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G114_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G114_LOW.
*/
#define	ETH_MAC_ADDRESS30_LOW	(ETH_MAC_ADDRESS_G114_LOW)

/** \\brief  1878, MAC Address High Register */
#define ETH_MAC_ADDRESS_G115_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E878u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G115_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G115_HIGH.
*/
#define	ETH_MAC_ADDRESS31_HIGH	(ETH_MAC_ADDRESS_G115_HIGH)

/** \\brief  187C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G115_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E87Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G115_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G115_LOW.
*/
#define	ETH_MAC_ADDRESS31_LOW	(ETH_MAC_ADDRESS_G115_LOW)

/** \\brief  1808, MAC Address High Register */
#define ETH_MAC_ADDRESS_G11_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E808u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G11_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G11_HIGH.
*/
#define	ETH_MAC_ADDRESS17_HIGH	(ETH_MAC_ADDRESS_G11_HIGH)

/** \\brief  180C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G11_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E80Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G11_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G11_LOW.
*/
#define	ETH_MAC_ADDRESS17_LOW	(ETH_MAC_ADDRESS_G11_LOW)

/** \\brief  1810, MAC Address High Register */
#define ETH_MAC_ADDRESS_G12_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E810u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G12_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G12_HIGH.
*/
#define	ETH_MAC_ADDRESS18_HIGH	(ETH_MAC_ADDRESS_G12_HIGH)

/** \\brief  1814, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G12_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E814u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G12_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G12_LOW.
*/
#define	ETH_MAC_ADDRESS18_LOW	(ETH_MAC_ADDRESS_G12_LOW)

/** \\brief  1818, MAC Address High Register */
#define ETH_MAC_ADDRESS_G13_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E818u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G13_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G13_HIGH.
*/
#define	ETH_MAC_ADDRESS19_HIGH	(ETH_MAC_ADDRESS_G13_HIGH)

/** \\brief  181C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G13_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E81Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G13_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G13_LOW.
*/
#define	ETH_MAC_ADDRESS19_LOW	(ETH_MAC_ADDRESS_G13_LOW)

/** \\brief  1820, MAC Address High Register */
#define ETH_MAC_ADDRESS_G14_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E820u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G14_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G14_HIGH.
*/
#define	ETH_MAC_ADDRESS20_HIGH	(ETH_MAC_ADDRESS_G14_HIGH)

/** \\brief  1824, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G14_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E824u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G14_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G14_LOW.
*/
#define	ETH_MAC_ADDRESS20_LOW	(ETH_MAC_ADDRESS_G14_LOW)

/** \\brief  1828, MAC Address High Register */
#define ETH_MAC_ADDRESS_G15_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E828u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G15_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G15_HIGH.
*/
#define	ETH_MAC_ADDRESS21_HIGH	(ETH_MAC_ADDRESS_G15_HIGH)

/** \\brief  182C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G15_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E82Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G15_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G15_LOW.
*/
#define	ETH_MAC_ADDRESS21_LOW	(ETH_MAC_ADDRESS_G15_LOW)

/** \\brief  1830, MAC Address High Register */
#define ETH_MAC_ADDRESS_G16_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E830u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G16_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G16_HIGH.
*/
#define	ETH_MAC_ADDRESS22_HIGH	(ETH_MAC_ADDRESS_G16_HIGH)

/** \\brief  1834, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G16_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E834u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G16_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G16_LOW.
*/
#define	ETH_MAC_ADDRESS22_LOW	(ETH_MAC_ADDRESS_G16_LOW)

/** \\brief  1838, MAC Address High Register */
#define ETH_MAC_ADDRESS_G17_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E838u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G17_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G17_HIGH.
*/
#define	ETH_MAC_ADDRESS23_HIGH	(ETH_MAC_ADDRESS_G17_HIGH)

/** \\brief  183C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G17_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E83Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G17_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G17_LOW.
*/
#define	ETH_MAC_ADDRESS23_LOW	(ETH_MAC_ADDRESS_G17_LOW)

/** \\brief  1840, MAC Address High Register */
#define ETH_MAC_ADDRESS_G18_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E840u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G18_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G18_HIGH.
*/
#define	ETH_MAC_ADDRESS24_HIGH	(ETH_MAC_ADDRESS_G18_HIGH)

/** \\brief  1844, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G18_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E844u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G18_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G18_LOW.
*/
#define	ETH_MAC_ADDRESS24_LOW	(ETH_MAC_ADDRESS_G18_LOW)

/** \\brief  1848, MAC Address High Register */
#define ETH_MAC_ADDRESS_G19_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E848u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G19_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G19_HIGH.
*/
#define	ETH_MAC_ADDRESS25_HIGH	(ETH_MAC_ADDRESS_G19_HIGH)

